# Importando Bibliotecas

In [1]:
import pandas as pd

# Puxando os Dados Principais

In [2]:
modalidade = pd.read_excel('dados/STG_MDL.xlsx')
pagamento = pd.read_excel('dados/STG_PGT.xlsx')
movimento = pd.read_excel('dados/STG_MVT_CRD.xlsx')
operacao = pd.read_excel('dados/STG_OPR_ITT.xlsx')
fonte = pd.read_excel('dados/STG_FNT_ITT.xlsx')

# Puxando os Dados Complementares

In [3]:
pessoa_fisica = pd.read_csv("dados/fatec_pessoa_fisica.csv", sep = '|', encoding='UTF-8', header = 1)
endereco_pessoa_fisica = pd.read_csv("dados/fatec_endereco_pessoa_fisica.csv", sep = '|', encoding='UTF-8', header = 1)
fatec_operacao = pd.read_csv("dados/fatec_opr.csv", sep = '|', encoding='UTF-8', header = 1)
fatec_movimento = pd.read_csv("dados/fatec_mvt.csv", sep = '|', encoding='UTF-8', header = 1)
fatec_pagamento = pd.read_csv("dados/fatec_pgt.csv", sep = '|', encoding='UTF-8', header = 1)

In [4]:
pessoa_fisica.head()

,Unnamed: 0,id,cpf,idc_sexo,ano_dat_nascimento,Unnamed: 5
0,+-----------+--------------+----------+-------...,NaN,NaN,NaN,NaN,NaN
1,NaN,804129883,37311167211,M,2000,NaN
2,NaN,246036379,34115266395,M,1969,NaN
3,NaN,218979283,35622655491,M,1970,NaN
4,NaN,717277229,33222324480,F,1994,NaN

In [5]:
endereco_pessoa_fisica.head()

,Unnamed: 0,id_pessoa_fisica,nom_cidade,des_estado,Unnamed: 4
0,+------------------+--------------------------...,NaN,NaN,NaN,NaN
1,NaN,41173256,TREMEMBE,SAO PAULO,NaN
2,NaN,212014803,SALVADOR,BAHIA,NaN
3,NaN,252868763,PORTO ALEGRE,RIO GRANDE DO SUL,NaN
4,NaN,351777344,CORURIPE,ALAGOAS,NaN

In [6]:
fatec_operacao.head()

,Unnamed: 0,id_opr_cad_pos,doc_cli,tip_cli,qtd_pcl,dat_vct_ult_pcl,vlr_ctrd_fta_tfm,sdo_ddr_tfm,vlr_ctrd,id_ult_rss_opr,id_mdl,cod_mdl,id_fnt,Unnamed: 13
0,+----------------+--------------+---------+---...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,NaN,0f503289-dfb,87308050371,F,52,20112023,NULL,259741.1685,28511582.7,25e351cc-ec4e-4a47-861e-834f2aa1dc13,14,C01,99,NaN
2,NaN,683ea107-f2e,54355614187,F,36,06112022,140141.5236,NULL,NULL,a1f18524-8a4f-40a5-ba31-6fbff83bfd58,10,B05,99,NaN
3,NaN,d8e48899-58d,92265948819,F,NULL,NULL,NULL,0.0000,NULL,63149b03-b3bd-41e3-9b33-86661155bbaf,15,D01,179,NaN
4,NaN,5909262c-526,104455393515,F,82,20112019,NULL,1520.5905,27626512.71,40367466-b381-4452-add6-641eafb6b1be,14,C01,99,NaN

In [7]:
fatec_movimento.head()

,Unnamed: 0,id_opr_cad_pos,id_mvt_cad_pos,dat_vct,qtd_pcl_vnc,qtd_pcl_pgr,vlr_tot_fat_tfm,vlr_min_fat_tfm,vlr_pcl_tfm,tip_mvt,prd,Unnamed: 11
0,+----------------+----------------+----------+...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,NaN,ed78c2f2-fd2,64d85edf-8b3,15062019,NULL,NULL,NULL,NULL,2728.3476,ANT,M,NaN
2,NaN,84706050-586,3e537b64-340,10042019,NULL,NULL,2195.7135,329.3049,NULL,ANT,NULL,NaN
3,NaN,7b3bc686-d7f,930e64c5-777,17022019,NULL,NULL,3791.8644,56870.4600,NULL,ANT,NULL,NaN
4,NaN,57a7735b-83e,79bac911-7a0,10022019,NULL,NULL,NULL,NULL,1284.6519,ANT,M,NaN

In [8]:
fatec_pagamento.head()

,Unnamed: 0,id_opr_cad_pos,id_mvt_cad_pos,id_pgt_cad_pos,dat_pgt,dat_vct_tfm,vlr_pgt_tfm,cod_mdl,cmd,Unnamed: 9
0,+----------------+----------------+-----------...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,NaN,c8176e21-845,cd596c84-3fe,f4ef9e73-e02,13102019,2019-10-13 03:00:00,591.3060,D01,E,NaN
2,NaN,a3fad4d7-ad7,3736da82-cd3,cffcab96-2b4,01032020,2020-03-01 03:00:00,6880.2081,D01,E,NaN
3,NaN,7fd6249b-4cf,f66a2496-e0a,b021cf9e-409,07122018,2019-12-12 03:00:00,6553.5303,B05,I,NaN
4,NaN,90fb53f6-225,0e3217ed-88e,72854add-8b9,07082019,2019-08-05 03:00:00,5980.6140,C01,I,NaN

## Limpando o DataFrame

Abaixo estamos definindo o nome da coluna bugada para ser usada na função a seguinte:

In [9]:
# Exemplo de como é a nomeclatura das colunas antes da alteração:

pessoa_fisica.columns[1:5]

Index([' id        ', ' cpf          ', ' idc_sexo ', ' ano_dat_nascimento '], dtype='object')

In [10]:
# Definindo as colunas que serão usadas:

pessoa_fisica_colunas = pessoa_fisica.columns[1:len(pessoa_fisica.columns) - 1]
endereco_pessoa_fisica_colunas = endereco_pessoa_fisica.columns[1:len(endereco_pessoa_fisica.columns) - 1]
fatec_operacao_colunas = fatec_operacao.columns[1:len(fatec_operacao.columns) - 1]
fatec_movimento_colunas = fatec_movimento.columns[1:len(fatec_movimento.columns) - 1]
fatec_pagamento_colunas = fatec_pagamento.columns[1:len(fatec_pagamento.columns) - 1]

In [11]:
# Estamos armazenando um exemplo do nome da coluna, para no código a seguir retirarmos a quebra de página:

coluna_pessoa_fisica = pessoa_fisica.columns[1]
coluna_endereco_pessoa_fisica = endereco_pessoa_fisica.columns[1]
coluna_fatec_operacao = fatec_operacao.columns[1]
coluna_fatec_movimento = fatec_movimento.columns[1]
coluna_fatec_pagamento = fatec_pagamento.columns[1]

In [12]:
# Demonstração da váriavel: 

coluna_pessoa_fisica

' id        '

## Redefinindo as colunas das tabelas

In [13]:
pessoa_fisica = pd.DataFrame(pessoa_fisica, columns = pessoa_fisica_colunas)
endereco_pessoa_fisica = pd.DataFrame(endereco_pessoa_fisica, columns = endereco_pessoa_fisica_colunas)
fatec_operacao = pd.DataFrame(fatec_operacao, columns = fatec_operacao_colunas)
fatec_movimento = pd.DataFrame(fatec_movimento, columns = fatec_movimento_colunas)
fatec_pagamento = pd.DataFrame(fatec_pagamento, columns = fatec_pagamento_colunas)

In [14]:
pessoa_fisica.head()

    id           cpf             idc_sexo    ano_dat_nascimento
0          NaN             NaN         NaN                   NaN
1   804129883    37311167211     M           2000
2   246036379    34115266395     M           1969
3   218979283    35622655491     M           1970
4   717277229    33222324480     F           1994

In [21]:
endereco_pessoa_fisica.head()

    id_pessoa_fisica    nom_cidade                     des_estado
0                 NaN                            NaN                      NaN
1   41173256            TREMEMBE                       SAO PAULO
2   212014803           SALVADOR                       BAHIA
3   252868763           PORTO ALEGRE                   RIO GRANDE DO SUL
4   351777344           CORURIPE                       ALAGOAS

In [23]:
fatec_operacao.head()

,id_opr_cad_pos,doc_cli,tip_cli,qtd_pcl,dat_vct_ult_pcl,vlr_ctrd_fta_tfm,sdo_ddr_tfm,vlr_ctrd,id_ult_rss_opr,id_mdl,cod_mdl,id_fnt
0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,0f503289-dfb,87308050371,F,52,20112023,NULL,259741.1685,28511582.7,25e351cc-ec4e-4a47-861e-834f2aa1dc13,14,C01,99
2,683ea107-f2e,54355614187,F,36,06112022,140141.5236,NULL,NULL,a1f18524-8a4f-40a5-ba31-6fbff83bfd58,10,B05,99
3,d8e48899-58d,92265948819,F,NULL,NULL,NULL,0.0000,NULL,63149b03-b3bd-41e3-9b33-86661155bbaf,15,D01,179
4,5909262c-526,104455393515,F,82,20112019,NULL,1520.5905,27626512.71,40367466-b381-4452-add6-641eafb6b1be,14,C01,99

In [24]:
fatec_movimento.head()

,id_opr_cad_pos,id_mvt_cad_pos,dat_vct,qtd_pcl_vnc,qtd_pcl_pgr,vlr_tot_fat_tfm,vlr_min_fat_tfm,vlr_pcl_tfm,tip_mvt,prd
0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,ed78c2f2-fd2,64d85edf-8b3,15062019,NULL,NULL,NULL,NULL,2728.3476,ANT,M
2,84706050-586,3e537b64-340,10042019,NULL,NULL,2195.7135,329.3049,NULL,ANT,NULL
3,7b3bc686-d7f,930e64c5-777,17022019,NULL,NULL,3791.8644,56870.4600,NULL,ANT,NULL
4,57a7735b-83e,79bac911-7a0,10022019,NULL,NULL,NULL,NULL,1284.6519,ANT,M

In [26]:
fatec_pagamento.head()

,id_opr_cad_pos,id_mvt_cad_pos,id_pgt_cad_pos,dat_pgt,dat_vct_tfm,vlr_pgt_tfm,cod_mdl,cmd
0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,c8176e21-845,cd596c84-3fe,f4ef9e73-e02,13102019,2019-10-13 03:00:00,591.3060,D01,E
2,a3fad4d7-ad7,3736da82-cd3,cffcab96-2b4,01032020,2020-03-01 03:00:00,6880.2081,D01,E
3,7fd6249b-4cf,f66a2496-e0a,b021cf9e-409,07122018,2019-12-12 03:00:00,6553.5303,B05,I
4,90fb53f6-225,0e3217ed-88e,72854add-8b9,07082019,2019-08-05 03:00:00,5980.6140,C01,I

## Redefinindo os nomes das colunas

In [15]:
# Definindo os novos nomes das colunas:

pessoa_fisica.columns = ['id', 'cpf', 'idc_sexo', 'ano_dat_nascimento']

In [16]:
# Nomeclatura das colunas depois da alteração:

pessoa_fisica.columns

Index(['id', 'cpf', 'idc_sexo', 'ano_dat_nascimento'], dtype='object')

## Retirando os valores nulos

In [17]:
# Exemplo da tabela antes de retirar os valores nulos entre as quebras de página:
pessoa_fisica.head()


# Como você pode observar na tabela abaixo, existe linhas entre as quebras de página, que possuem valores nulos

            id             cpf    idc_sexo    ano_dat_nascimento
0          NaN             NaN         NaN                   NaN
1   804129883    37311167211     M           2000
2   246036379    34115266395     M           1969
3   218979283    35622655491     M           1970
4   717277229    33222324480     F           1994

In [18]:
# Retirando os valores nulos entre as quebras de página:

pessoa_fisica = pessoa_fisica[(pd.isna(pessoa_fisica['cpf']) != True)]

## Retirando as quebras de pagina no DataFrame

In [19]:
# Usando a váriavel anterior para retirar as quebrar de página:

pessoa_fisica = pessoa_fisica[(pessoa_fisica['cpf'] != ' cpf          ')]

In [20]:
pessoa_fisica

               id             cpf    idc_sexo    ano_dat_nascimento
1      804129883    37311167211     M           2000
2      246036379    34115266395     M           1969
3      218979283    35622655491     M           1970
4      717277229    33222324480     F           1994
5      3674219      1505546115      M           1971
...           ...             ...         ...                   ...
3004   123479485    255051104931    M           1983
3005   271099619    223885940544    F           1962
3006   209547061    265864987976    F           1975
3007   97718872     262208637843    F           1983
3008   66330285     255487112307    F           1983

[3000 rows x 4 columns]